<script>
import 'slick-carousel/slick/slick.css';
import 'slick-carousel/slick/slick-theme.css';
import $ from 'jquery';
import 'slick-carousel';

export default {
    mounted() {
        $('.slider').on('init afterChange', function (event, slick, currentSlide, nextSlide) {
            var slideCount = slick.slideCount;
            var currentSlideIndex = slick.currentSlide;

            // Проверка, достигнут ли конец слайдера
            if (currentSlideIndex === 0) {
                $('.custom-prev').addClass('disabled');
            } else {
                $('.custom-prev').removeClass('disabled');
            }

            if (currentSlideIndex === slideCount - 1) {
                $('.custom-next').addClass('disabled');
            } else {
                $('.custom-next').removeClass('disabled');
            }
        });

        $(this.$refs.slick).slick({
            slidesToShow: 1,
            slidesToScroll: 1,
            prevArrow: $(".custom-prev"),
            nextArrow: $(".custom-next"),
            vertical: true,
            verticalSwiping: true,
            // adaptiveHeight: true,
            infinite: false,
            speed: 500,

        });
    },
};
</script>
<template>
    <section class="forum_about">
        <div class="container">
            <div class="slider">
                <button class="custom-prev"><i class='bx bx-chevron-up'></i></button>
                <div ref="slick" class="slick-slider">
                    <div class="slide">
                        <h2>Аниме</h2>
                        <p class="forum-p">
                            <img src="../img/forum/about-anime.png" alt="about-anime" class="right_img">
                            Аниме (от англ. animation — «анимация») — японская мультипликация. В отличие от мультфильмов
                            других
                            стран,
                            предназначенных в основном для просмотра детьми, бо́льшая часть выпускаемого аниме рассчитана на
                            подростковую и взрослую аудитории, и во многом за счёт этого имеет высокую популярность в мире.
                            Аниме
                            отличается характерной манерой отрисовки персонажей и фонов. Издаётся в форме телевизионных
                            сериалов,а
                            также
                            фильмов, распространяемых на видеоносителях или предназначенных для кинопоказа. Сюжеты могут
                            описывать
                            множество персонажей, отличаться разнообразием мест и эпох, жанров и стилей.
                            Источниками для сюжета аниме-сериалов чаще всего являются: манга (японские комиксы), ранобэ
                            (лайт-новел)
                            или
                            компьютерные игры (как правило, в жанре «визуальный роман»). При экранизации обычно сохраняется
                            графический
                            стиль и другие особенности оригинала. Реже используются другие источники, например, произведения
                            классической литературы. Есть также аниме, имеющие полностью оригинальный сюжет (в этом случае
                            уже само
                            аниме может послужить источником для создания по нему книжных и манга-версий). Значение термина
                            «аниме»
                            может варьироваться в зависимости от контекста.
                        </p>
                    </div>
                    <div class="slide">
                        <h2>История аниме</h2>
                        <p class="forum-p">
                            История аниме берёт начало в XX веке, когда японские кинорежиссёры начинают первые эксперименты
                            с техниками
                            мультипликации, изобретёнными на Западе. Старейшая из известных сохранившихся японских анимаций
                            — «Katsudo
                            Shashin» длится всего 3 секунды. Одним из самых первых аниме стал продемонстрированный в 1917
                            году
                            двухминутный комедийный фильм «Namakura Gatana», в котором самурай собирается испытать свой
                            новый меч, но
                            терпит поражение от горожанина. Первопроходцами в области японской мультипликации стали Симокава
                            Отэн,
                            Дзюнъити Коти и Сэитаро Китаяма. Одним из наиболее популярных и доступных методов на тот момент
                            была техника
                            вырезной анимации, её применяли такие аниматоры, как Санаэ Ямамото, Ясудзи Мурата и Ноборо
                            Офудзи.
                            Позднее распространилась также техника аппликационной анимации. Успеха в развитии техники
                            анимации добились
                            и другие мультипликаторы, такие как Кэндзо
                            Масаока и Мицуё Сэо, использовавшие, в частности, анимационные фильмы в образовательных и
                            пропагандистских
                            целях. Первым звуковым аниме стал снятый Масаокой в 1933 году короткометражный фильм Chikara to
                            Onna no Yo
                            no Naka. К 1940 году начали образовываться организации мультипликаторов и художников, такие как
                            Shin Mangaha
                            Shudan и Shin Nippon Mangaka. В то время аниме активно использовалось в качестве средства
                            государственной
                            пропаганды. Одним из первых полнометражных анимационных фильмов стал снятый Мицуё Сэо в 1945
                            году
                            «Momotarou: Umi no Shinpei»; спонсорскую поддержку при создании фильма оказал Императорский флот
                            Японии.
                        </p>

                        <div class="left_img_wrapper">
                            <span class="left_img_wrapper_title">
                                Унесенные призраками
                            </span>
                            <img src="../img/forum/history2.png" alt="about-anime" class="left_img">
                            <span class="left_img_wrapper_title_params">
                                Сэн то Тихиро но камикакуси
                            </span>
                            <ul class="ul_items">
                                <li>
                                    <ul>
                                        <li class="title">
                                            Режиссёр
                                        </li>
                                        <li class="params">
                                            Хаяо Миядзаки
                                        </li>
                                    </ul>
                                </li>
                                <li>
                                    <ul>
                                        <li class="title">
                                            Сценарист
                                        </li>
                                        <li class="params">
                                            Хаяо Миядзаки
                                        </li>
                                    </ul>
                                </li>
                                <li>
                                    <ul>
                                        <li class="title">
                                            Продюсер
                                        </li>
                                        <li class="params">
                                            Тосио Судзуки
                                        </li>
                                    </ul>
                                </li>
                                <li>
                                    <ul>
                                        <li class="title">
                                            Композитор
                                        </li>
                                        <li class="params">
                                            Дзё Хисаиси
                                        </li>
                                    </ul>
                                </li>
                                <li>
                                    <ul>
                                        <li class="title">
                                            Студия
                                        </li>
                                        <li class="params">
                                            Studio Ghibli
                                        </li>
                                    </ul>
                                </li>
                            </ul>
                        </div>
                        <p class="forum-p">
                            Основоположником традиций современного аниме стал Осаму Тэдзука — он заложил основы того, что
                            позднее
                            преобразовалось в современные аниме-сериалы. Например, Тэдзука заимствовал у Диснея и развил
                            манеру
                            использования больших глаз персонажей для передачи эмоций; именно под его руководством возникали
                            первые
                            произведения, которые можно отнести к ранним аниме. Первой работой Тэдзуки стала манга «Shin
                            Takarajima».
                            Впоследствии он создал мангу под названием Tetsuwan Atomu (Astro Boy), которая и принесла ему
                            успех. К
                            1970-м годам популярность манги заметно возросла, многие произведения были анимированы. Тэдзуку
                            благодаря
                            его работам часто называли «легендой» и «богом манги и аниме».
                            За почти вековую историю аниме прошло долгий путь развития от первых экспериментов в анимации,
                            фильмов
                            Тэдзуки до нынешней огромной популярности по всему миру. С годами сюжеты аниме, первоначально
                            рассчитанного
                            на детей, становились всё сложнее, обсуждаемые проблемы всё серьёзней.
                            Появились аниме-сериалы, рассчитанные на подростковую аудиторию — юношей и девушек старше
                            четырнадцати лет.
                            Эти сериалы нашли поклонников и среди взрослых, в редких случаях вплоть до преклонных лет. В
                            своём развитии
                            аниме немного отставало от манги, которая зародилась на несколько лет раньше и к тому времени
                            уже завоевала
                            популярность среди всех кругов населения Японии.
                            Сегодня аниме представляет собой уникальный культурный пласт, объединяющий как сериалы для детей
                            (жанр
                            кодомо) — аниме в его изначальном понимании, так и подростковые произведения, зачастую,
                            достаточно серьёзные
                            и для просмотра взрослыми — сёнэн (аниме для юношей), сёдзё (аниме для девушек) и даже
                            полноценное
                            «взрослое» аниме (сэйнэн и дзёсэй).
                            Вершиной аниме принято считать работы режиссёра Хаяо Миядзаки. Его «Унесённые призраками» стали
                            первым и
                            единственным анимационным фильмом, получившим премию Берлинского кинофестиваля, как «Лучший
                            фильм», а не
                            «Лучший мультфильм».
                        </p>
                    </div>
                    <div class="slide">
                        <h2>Жанры аниме</h2>
                        <p class="forum-p">
                            Кодомо, полностью кодомомукэ манга (яп. 子供向け漫画) и кодомомукэ аниме (яп. 子供向けアニメ) — манга и
                            аниме, предназначенные для детей до 12 лет. Отличительная особенность этого жанра — в его
                            «детскости», отсутствии (иногда просто сильно упрощено) идейного наполнения. Сюда же можно
                            добавить характерный рисунок. Часто кодомо-аниме очень близко к европейской или американской
                            анимационной школе и сильно отличается от других видов аниме не только по рисунку, но и по
                            построению сериала. Более того, неопытный глаз вряд ли отличит работу японских мастеров от
                            других работ того же плана. Однако, все мультсериалы такого рода, при условии, что они
                            создавались в Японии, принято считать одной из разновидностей аниме. Кодомо обычно рисуется без
                            проявлений жесткости и грубости, часто несёт развлекательный характер. Примерами таких работ
                            являются «Пчёлка Майя», «Грендайзер», «Гонщик Спиди».
                            Сёнэн — аниме для старших мальчиков и юношей (с 12 до 16-18 лет). Основные признаки жанра:
                            быстрое развитие и ярко выраженный динамизм сюжета. Произведения содержат множество
                            юмористических сцен, основываются на темах крепкой мужской дружбы, любого вида соперничества в
                            жизни, спорте или в боевых искусствах. Девушки и женщины в сёнэн аниме часто изображаются
                            преувеличенно красивыми, такое гипертрофирование служит для наилучшего проявления мужественности
                            главных героев. Как вариант, множество красивых девушек стараются привлечь внимание одного
                            героя. Соответственно, поджанрами жанра сёнэн являются сэнтай, рассказывающий о приключениях
                            небольшой постоянной команды персонажей (традиционно из 5 человек), борющихся с кем-либо или с
                            чем-либо; спокон, повествующий о юных спортсменах, добивающихся успеха путём воспитания в себе
                            воли к победе; гарем, в котором персонаж мужского пола оказывается окружён большим количеством
                            женщин.
                            Сёдзё — аниме и манга для старших девочек и девушек (с 12 до 16-18 лет)[2]. В сюжете сёдзё
                            аниме, как правило, присутствуют любовные отношения разной степени близости, в зависимости от
                            возраста целевой аудитории, большое внимание уделяется развитию образов персонажей. Как
                            характерные черты можно отметить: преувеличенная условность рисунка (гротеско-юмористическая)
                            или же, наоборот, утончённо-романтическая. Герои мужского пола выделяются внешними данными.
                            Поджанром сёдзё является махо-сёдзё, рассказывающий о приключениях девочек, наделённых
                            магической силой (например, «Сейлор Мун»).
                            Дзёсэй — аниме или манга для женщин. Сюжет чаще всего описывает повседневную жизнь женщины,
                            живущей в Японии. Как правило, часть повествования отводится под события из школьной жизни
                            главной героини (именно в это время она знакомится с другими действующими лицами и происходит
                            завязка сюжета). Стиль рисунка, используемый в дзёсэе, немного более реалистичен, чем в сёдзё,
                            однако сохраняет в себе некоторые его характерные особенности. Опять-таки, в отличие от сёдзё,
                            любовные отношения изображены в дзёсэе намного более проработанно (Paradise Kiss, Honey and
                            Clover).
                        </p>
                    </div>

                </div>

            </div>
            <div class="next-wrapper">
                <button class="custom-next"><i class='bx bx-chevron-down'></i></button>
            </div>

        </div>
    </section>
</template>
<style scoped>
.params {
    color: rgb(201, 201, 201);
    font-weight: 200;
    font-size: 14px;
}

.title {
    color: #fff;
    font-weight: 200;
    font-size: 15px;
}

.left_img_wrapper_title {
    color: #fff;
    display: block;
    background-color: #2F2F2F;
    padding: 10px;
    font-size: 20px;
    font-weight: 300;
    width: 250px;
    margin-bottom: 10px;
}

.left_img_wrapper_title_params {
    color: #fff;
    display: block;
    background-color: #2F2F2F;
    padding: 10px;
    font-weight: 300;
    font-size: 16px;
    width: 250px;
    margin-top: 5px;
}
.disabled{
    opacity: 0 !important;
    transition: 200ms all ease;
}
.disabled:hover{
    opacity: 0 !important;
    cursor: default !important;
}
.left_img_wrapper {
    display: flex;
    flex-direction: column;
    float: left;
}

.left_img_wrapper img {
    width: 250px;
}

.ul_items li ul {
    display: flex;
    justify-content: space-between;
    padding-bottom: 8px;
}

.ul_items {
    margin-top: 10px;
    padding: 10px 10px 2px 10px;
    background-color: #2F2F2F;
    width: 250px;
}

.next-wrapper {
    position: absolute;
    bottom: -50px;
    left: 50%;
    margin-right: -50%;
    transform: translate(-50%, -50%);
    z-index: 999;
    height: 100px;
    background-color: #171717;
    width: 100%;
}

.custom-prev,
.custom-next {
    position: absolute;
    background-color: transparent;
    text-align: center !important;
    transition: 200ms all ease;
}

.custom-prev:hover,
.custom-next:hover {
    opacity: 70%;
    cursor: pointer;
}

.custom-prev:active,
.custom-next:active {
    opacity: 60%;
}

.custom-prev i,
.custom-next i {
    color: #fff;
    font-size: 60px;
    font-weight: 100;
}



.slide {
    overflow: scroll;
    height: 65vh;
}

::-webkit-scrollbar {
    width: 0;
}

.custom-prev {
    top: 20px;
    left: 50%;
    margin-right: -50%;
    transform: translate(-50%, -50%);
    z-index: 999;
}

.custom-next {
    bottom: -10px;
    left: 50%;
    margin-right: -50%;
    transform: translate(-50%, -50%);
    z-index: 999;
}

.slider {
    padding-top: 60px;
    position: relative;
}


section {
    margin-bottom: 80px;
}

.right_img {
    float: right;
    margin: 7px 0 7px 7px;
}

.left_img {
    float: left;
    margin-right: 25px;
    margin-bottom: 10px;
}</style>